name: "tokenizer"
backend: "python"
max_batch_size: 0


input [
    {
        name: "texts"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

output [
    {
        name: "input_ids"
        data_type: TYPE_INT64
        dims: [ -1, 512 ]
    },
    {
        name: "attention_mask"
        data_type: TYPE_INT64
        dims: [ -1, 512 ]
    }

]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]