name: "distilbert"
platform: "onnxruntime_onnx"
max_batch_size: 0


input [
    {
        name: "input_ids"
        data_type: TYPE_INT64
        dims: [ -1, 512 ]
    },
    {
        name: "attention_mask"
        data_type: TYPE_INT64
        dims: [ -1, 512 ]
    }
]

output [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [ -1, 10 ]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]