name: "ensemble"
platform: "ensemble"

input [
    {
        name: "texts"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

output [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [ -1, 10 ]
    }
]

ensemble_scheduling {
    step [
        {
            model_name: "tokenizer"
            model_version: -1
            input_map {
                key: "texts"
                value: "texts"
            }
            output_map {
                key: "input_ids"
                value: "input_ids"
            }
            output_map {
                key: "attention_mask"
                value: "attention_mask"
            }
        },
        {
            model_name: "distilbert"
            model_version: -1
            input_map {
                key: "input_ids"
                value: "input_ids"
            }
            input_map {
                key: "attention_mask"
                value: "attention_mask"
            }
            output_map {
                key: "logits"
                value: "logits"
            }
        }
    ]
}